# MovieLens Analytics

In this project, I'll analyze 45,000 movies from MovieLens Dataset consisting of movies up to July 2017 with the use of PostgreSQL and Pandas

data source: https://www.kaggle.com/datasets/rounakbanik/the-movies-dataset?select=movies_metadata.csv

To keep things more compact and readable, let's explore data and figure out what columns we'll use in later SQL queries with the help of Pandas

# Data Preparation with Pandas

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/movies_metadata.csv')
# Transpose for easier exploration of this dataset with many cols
df.head(3).transpose()

C:\Windows\Temp\ipykernel_8544\3199233999.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('data/movies_metadata.csv')

,0,1,2
adult,False,False,False
belongs_to_collection,"{'id': 10194, 'name': 'Toy Story Collection', ...",NaN,"{'id': 119050, 'name': 'Grumpy Old Men Collect..."
budget,30000000,65000000,0
genres,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...","[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...","[{'id': 10749, 'name': 'Romance'}, {'id': 35, ..."
homepage,http://toystory.disney.com/toy-story,NaN,NaN
id,862,8844,15602
imdb_id,tt0114709,tt0113497,tt0113228
original_language,en,en,en
original_title,Toy Story,Jumanji,Grumpier Old Men
overview,"Led by Woody, Andy's toys live happily in his ...",When siblings Judy and Peter discover an encha...,A family wedding reignites the ancient feud be...
popularity,21.946943,17.015539,11.7129
poster_path,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg
production_companies,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'name': 'Warner Bros.', 'id': 6194}, {'name'..."
production_countries,"[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o..."
release_date,1995-10-30,1995-12-15,1995-12-22
revenue,373554033.0,262797249.0,0.0
runtime,81.0,104.0,101.0
spoken_languages,"[{'iso_639_1': 'en', 'name': 'English'}]","[{'iso_639_1': 'en', 'name': 'English'}, {'iso...","[{'iso_639_1': 'en', 'name': 'English'}]"
status,Released,Released,Released
tagline,NaN,Roll the dice and unleash the excitement!,Still Yelling. Still Fighting. Still Ready for...
title,Toy Story,Jumanji,Grumpier Old Men
video,False,False,False
vote_average,7.7,6.9,6.5
vote_count,5415.0,2413.0,92.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 24 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   adult                  45466 non-null  object
 1   belongs_to_collection  4494 non-null   object
 2   budget                 45466 non-null  object
 3   genres                 45466 non-null  object
 4   homepage               7782 non-null   object
 5   id                     45466 non-null  object
 6   imdb_id                45449 non-null  object
 7   original_language      45455 non-null  object
 8   original_title         45466 non-null  object
 9   overview               44512 non-null  object
 10  popularity             45461 non-null  object
 11  poster_path            45080 non-null  object
 12  production_companies   45463 non-null  object
 13  production_countries   45463 non-null  object
 14  release_date           45379 non-null  object
 15  revenue                45460 non-null  float64
 16  runtime                45203 non-null  float64
 17  spoken_languages       45460 non-null  object
 18  status                 45379 non-null  object
 19  tagline                20412 non-null  object
 20  title                  45460 non-null  object
 21  video                  45460 non-null  object
 22  vote_average           45460 non-null  float64
 23  vote_count             45460 non-null  float64
dtypes: float64(4), object(20)
memory usage: 8.3+ MB

In [4]:
df["adult"].value_counts()

False                                                                                                                             45454
True                                                                                                                                  9
 - Written by Ørnås                                                                                                                   1
 Rune Balot goes to a casino connected to the October corporation to try to wrap up her case once and for all.                        1
 Avalanche Sharks tells the story of a bikini contest that turns into a horrifying affair when it is hit by a shark avalanche.        1
Name: adult, dtype: int64

In [5]:
df["video"].value_counts()

False    45367
True        93
Name: video, dtype: int64

In [6]:
df["status"].value_counts()

Released           45014
Rumored              230
Post Production       98
In Production         20
Planned               15
Canceled               2
Name: status, dtype: int64

The columns 'adult', 'status' and 'video' have predominantly one value, so let's remove them. Also, let's remove 'poster_path', 'hopepage' (not many not null values), 'id' and 'imdb_id' (we'll stick to one table for now), 'spoken_languages', 'overview' and 'tagline' (we won't be conducting text analysis here + rows can get inconsistent with big amount of text from these cols)

In [7]:
df = df.drop(
    [
        "adult",
        "status",
        "video",
        "poster_path",
        "original_title",
        "homepage",
        "id",
        "imdb_id",
        "spoken_languages",
        "overview",
        "tagline",
    ],
    axis=1,
)
df.head(3).transpose()

,0,1,2
belongs_to_collection,"{'id': 10194, 'name': 'Toy Story Collection', ...",NaN,"{'id': 119050, 'name': 'Grumpy Old Men Collect..."
budget,30000000,65000000,0
genres,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...","[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...","[{'id': 10749, 'name': 'Romance'}, {'id': 35, ..."
original_language,en,en,en
popularity,21.946943,17.015539,11.7129
production_companies,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'name': 'Warner Bros.', 'id': 6194}, {'name'..."
production_countries,"[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o..."
release_date,1995-10-30,1995-12-15,1995-12-22
revenue,373554033.0,262797249.0,0.0
runtime,81.0,104.0,101.0
title,Toy Story,Jumanji,Grumpier Old Men
vote_average,7.7,6.9,6.5
vote_count,5415.0,2413.0,92.0

##### IMPORTANT: strange cases like budget of 0 for 'Grumpier Old Men' at the right will be handled in later SQL queries

Now let's have a look at dtypes

## Converting dtypes to more appropriate ones

In [8]:
df.dtypes

belongs_to_collection     object
budget                    object
genres                    object
original_language         object
popularity                object
production_companies      object
production_countries      object
release_date              object
revenue                  float64
runtime                  float64
title                     object
vote_average             float64
vote_count               float64
dtype: object

First of all, let's handle 'release_date' column

In [9]:
# Convert 'release_date' column to datetime type
df['release_date'] = pd.to_datetime(df['release_date'], errors='coerce')
# Count the number of rows with bad date values
bad_date_count = df['release_date'].isnull().sum()
print(f"Number of rows with bad date values: {bad_date_count}")

Number of rows with bad date values: 90

Since 90 rows compared to 45,000 in total is nothing, we can freely remove them

In [10]:
# Remove rows with null or NaT values
df = df.dropna(subset=['release_date'])
bad_date_count = df['release_date'].isnull().sum()
print(f"Number of rows with bad date values: {bad_date_count}")

Number of rows with bad date values: 0

The column 'budget' contains non-numerical values like '/ff9qCepilowshEtG2GYWwzt2bs4.jpg'. Let's remove them

In [11]:
# Clean 'budget' column to remove non-numeric characters
df["budget"] = df["budget"].str.replace(r"\D", "", regex=True)

I don't like that columns with whole numbers like 'runtime' or 'vote_count' have dtype set to float. Let's change that

In [12]:
# Specify columns and their new data types
dict_columns_to_convert = {
    "budget": "int64",
    "revenue": "int64",
    "runtime": "int",
    "vote_count": "int"
}
# Clean 'budget' column to remove non-numeric characters
df["budget"] = df["budget"].str.replace(r"\D", "", regex=True)
# Fill NaN values with 0
cols_to_fill = list(dict_columns_to_convert.keys())
df[cols_to_fill] = df[cols_to_fill].fillna(0)
# Convert columns to integer type
df = df.astype(dict_columns_to_convert)
# Check the data types of the DataFrame
print(df.dtypes)

belongs_to_collection            object
budget                            int64
genres                           object
original_language                object
popularity                       object
production_companies             object
production_countries             object
release_date             datetime64[ns]
revenue                           int64
runtime                           int32
title                            object
vote_average                    float64
vote_count                        int32
dtype: object

Time to extract data from JSON columns

## Working with 'belongs_to_collection' column

In [13]:
from ast import literal_eval

def extract_franchise_name(x):
    try:
        # Use literal_eval to safely evaluate the string as a Python dictionary
        # Extract the 'name' value from the dictionary
        return literal_eval(x)["name"]
    except (ValueError, TypeError):
        return None

# Apply the extract_franchise_name function to each value in the 'belongs_to_collection' column
df["franchise"] = df["belongs_to_collection"].apply(extract_franchise_name).str.strip()
# Remove the word 'Collection' (case-insensitive) from the end of each franchise name
df["franchise"] = df["franchise"].str.replace(r"[Cc]ollection$", "", regex=True)
# Remove trailing spaces before and after the string
df["franchise"] = df["franchise"].str.strip()
df = df.drop(["belongs_to_collection"], axis=1)

In [14]:
df["franchise"].value_counts().head(7)

The Bowery Boys                  29
Totò                             27
Zatôichi: The Blind Swordsman    26
James Bond                       26
The Carry On                     25
Pokémon                          22
Charlie Chan (Sidney Toler)      21
Name: franchise, dtype: int64

## Working with 'production_countries' column

In [15]:
def process_countries(countries):
    try:
        countries_list = literal_eval(countries)
        if len(countries_list) == 1:
            return countries_list[0]["name"]
        # Put 'Multiple' if movie was made in several countries
        elif len(countries_list) > 1:
            return "Multiple"
        # Put 'NULL' if the field is empty
        else:
            return None
    except (ValueError, TypeError):
        return None

# Apply the process_countries function to each value in the 'production_countries' column
df["production_country"] = df["production_countries"].apply(process_countries)
df = df.drop(["production_countries"], axis=1)

In [16]:
df["production_country"].value_counts().head(7)

United States of America    17846
Multiple                     7026
United Kingdom               2235
France                       1653
Japan                        1356
Italy                        1029
Canada                        840
Name: production_country, dtype: int64

## Working with 'genres' column

In [17]:
# Convert the stringified JSON into a list of dictionaries
df["genres"] = df["genres"].apply(
    lambda x: literal_eval(x.replace("'", '"')) if isinstance(x, str) else []
)
# Extract the names of genres into a list and sort them alphabetically
df["genres"] = df["genres"].apply(
    lambda x: sorted([genre["name"] for genre in x]) if isinstance(x, list) else []
)
# Display the DataFrame with the extracted genre names
df[["title", "genres"]].head(3)

              title                        genres
0         Toy Story   [Animation, Comedy, Family]
1           Jumanji  [Adventure, Family, Fantasy]
2  Grumpier Old Men             [Comedy, Romance]

In [18]:
# Flatten the list of genre names
flat_genre_names = [genre for sublist in df["genres"] for genre in sublist]
# Get the unique genre names
unique_genre_names = set(flat_genre_names)
# Print the unique genre names
print(f"There are {len(unique_genre_names)} unique genres.")
print(unique_genre_names)

There are 20 unique genres.
{'Comedy', 'Romance', 'Drama', 'Action', 'History', 'Adventure', 'Animation', 'TV Movie', 'Crime', 'Family', 'Science Fiction', 'Mystery', 'Music', 'Documentary', 'Foreign', 'Thriller', 'War', 'Western', 'Fantasy', 'Horror'}

We can see that 'genres' colomn has faulty data like 'Carousel Productions' or 'Vision View Entertainment', which sound like production companies, not genres. Thus, let's remove such values from the column

In [19]:
# Define the list of valid genre names
valid_genres = {
    'Action', 'Adventure', 'Animation', 'Comedy', 'Crime', 'Documentary',
    'Drama', 'Family', 'Fantasy', 'History', 'Horror', 'Music', 'Mystery',
    'Romance', 'Science Fiction', 'TV Movie', 'Thriller', 'War', 'Western'
}
# Filter the genre_names column to include only the valid genres
df["genres"] = df["genres"].apply(lambda x: [genre for genre in x if genre in valid_genres])

Now let's check again

In [20]:
flat_genre_names = [genre for sublist in df["genres"] for genre in sublist]
unique_genre_names = set(flat_genre_names)
print(f"There are {len(unique_genre_names)} unique genres.")
print(unique_genre_names)

There are 19 unique genres.
{'Comedy', 'Romance', 'Drama', 'Action', 'History', 'Adventure', 'Animation', 'TV Movie', 'Crime', 'Family', 'Science Fiction', 'Mystery', 'Music', 'Documentary', 'Thriller', 'War', 'Western', 'Fantasy', 'Horror'}

In [21]:
df["genres"].value_counts().head(7)

[Drama]              5296
[Comedy]             3698
[Documentary]        2839
[]                   2403
[Drama, Romance]     1792
[Comedy, Drama]      1748
[Comedy, Romance]    1165
Name: genres, dtype: int64

One movie can belong to many genres and one genre can be applied to many movies. It's a many-to-many relationship. Ideally, this kind of relationship is supposed to be broken into two 1:M relationships and connected with an intermidiate or junction table. However, because

- it's a project to show my knowledge mainly of writing SQL queries
- I'm applying to a junior data analyst position, and, at that role, you're not supposed to design databases
- preparation part is already too long
- maximum string length for genres is known (80 symbols for the movie with the title 'Yu-Gi-Oh')

I'll keep things simple and connect genre names by comma.

In [22]:
# Convert the list of genres into a string with comma as a delimiter
df["genres"] = df["genres"].apply(lambda x: ", ".join(x) if x else None)

In [23]:
df["genres"].value_counts().head(7)

Drama                     5296
Comedy                    3698
Documentary               2839
Drama, Romance            1792
Comedy, Drama             1748
Comedy, Romance           1165
Comedy, Drama, Romance    1096
Name: genres, dtype: int64

And so the time has come to work with the last JSON column

## Working with 'production_companies' column

In [25]:
def process_companies(companies):
    try:
        companies_list = literal_eval(companies)
        if len(companies_list) == 1:
            return companies_list[0]["name"]
        elif len(companies_list) > 1:
            return ", ".join([company["name"] for company in companies_list])
        else:
            return None
    except (ValueError, TypeError):
        return None

# Apply the process_companies function to each value in the 'production_companies' column
df["production_companies"] = df["production_companies"].apply(process_companies)
df[["title", "production_companies"]].head()

,title,production_companies
0,Toy Story,Pixar Animation Studios
1,Jumanji,"TriStar Pictures, Teitler Film, Interscope Com..."
2,Grumpier Old Men,"Warner Bros., Lancaster Gate"
3,Waiting to Exhale,Twentieth Century Fox Film Corporation
4,Father of the Bride Part II,"Sandollar Productions, Touchstone Pictures"

In [26]:
df["production_companies"].value_counts().head(10)

Metro-Goldwyn-Mayer (MGM)                 742
Warner Bros.                              540
Paramount Pictures                        505
Twentieth Century Fox Film Corporation    439
Universal Pictures                        320
RKO Radio Pictures                        247
Columbia Pictures Corporation             207
Columbia Pictures                         146
Mosfilm                                   145
Walt Disney Pictures                       85
Name: production_companies, dtype: int64

After all the operations completed above, we have the following df

In [28]:
df.head(3).transpose()

,0,1,2
budget,30000000,65000000,0
genres,"Animation, Comedy, Family","Adventure, Family, Fantasy","Comedy, Romance"
original_language,en,en,en
popularity,21.946943,17.015539,11.7129
production_companies,Pixar Animation Studios,"TriStar Pictures, Teitler Film, Interscope Com...","Warner Bros., Lancaster Gate"
release_date,1995-10-30 00:00:00,1995-12-15 00:00:00,1995-12-22 00:00:00
revenue,373554033,262797249,0
runtime,81,104,101
title,Toy Story,Jumanji,Grumpier Old Men
vote_average,7.7,6.9,6.5
vote_count,5415,2413,92
franchise,Toy Story,None,Grumpy Old Men
production_country,United States of America,United States of America,United States of America

## Final steps of data preparation with Pandas

Time to add index col, change dtypes, and rearrange columns a little bit because I'm not happy with the order of columns

In [29]:
# add index column
df["id"] = range(1, len(df) + 1)
new_cols_order = [
    "id",
    "title",
    "franchise",
    "release_date",
    "runtime",
    "genres",
    "production_country",
    "production_companies",
    "original_language",
    "budget",
    "revenue",
    "popularity",
    "vote_average",
    "vote_count"
]
df = df[new_cols_order]
df.head(3).transpose()

,0,1,2
id,1,2,3
title,Toy Story,Jumanji,Grumpier Old Men
franchise,Toy Story,None,Grumpy Old Men
release_date,1995-10-30 00:00:00,1995-12-15 00:00:00,1995-12-22 00:00:00
runtime,81,104,101
genres,"Animation, Comedy, Family","Adventure, Family, Fantasy","Comedy, Romance"
production_country,United States of America,United States of America,United States of America
production_companies,Pixar Animation Studios,"TriStar Pictures, Teitler Film, Interscope Com...","Warner Bros., Lancaster Gate"
original_language,en,en,en
budget,30000000,65000000,0
revenue,373554033,262797249,0
popularity,21.946943,17.015539,11.7129
vote_average,7.7,6.9,6.5
vote_count,5415,2413,92

Columns explanation:
- id - row id
- title - official title of the movie
- franchise - a particular franchise to which the movie belongs, if applicable
- release_date - theatrical release date of the movie
- runtime - movie duration/runtime in minutes
- genres - genres associated with the movie, separated by a comma
- production_country - the country/countries where the movie was shot/produced. If several countries were involved, the cell contains the value 'Multiple'
- production_companies - production companies involved in making of the movie
- original_language - the language in which the movie was originally shot
- budget - movie budget in dollars
- revenue - total movie revenue in dollars
- popularity - popularity score assigned by TMDB
- vote_average - average movie rating
- vote_count - number of votes by users, counted by TMDB

Let's save the cleaned up dataset, which we'll use in the next chapters

In [30]:
# df.to_csv("data/data_v2.csv", index=False)

# Loading Data to PostgreSQL

Okay, time to finally work with databases

## Creating a new database

<img src="images/creating_database_1.png">

<img src="images/creating_database_2.png">

<img src="images/creating_database_3.png">

Database is successfully created. Now time to create a table for our movies data

## Creating 'movies' table

<img src="images/creating_table_1.png">

And to the last step - filling the newly created table with data

## Filling table with data

<img src="images/filling_table_1.png">

<img src="images/filling_table_2.png">

<img src="images/filling_table_3.png">

<img src="images/filling_table_4.png">

<img src="images/filling_table_5.png">

# Connecting to the database in Jupyter Notebook

To be able to connect to our database, we'll need the following libraries:

1. **ipython-sql**: Enables executing SQL queries in Jupyter Notebooks for direct database interaction.

2. **psycopg2**: Python adapter for PostgreSQL, facilitating PostgreSQL database interaction.

3. **configparser**: Manages configuration settings, like database credentials, in a more secure way.

In [1]:
import psycopg2
import configparser
import pandas as pd
# magic function used to connect with the postgresql database
%load_ext sql

Read the parameters from the config file

In [2]:
config = configparser.ConfigParser()
config.read('db_vars.cfg')
DB_USER = config.get('SQL', 'DB_USER')
DB_PASSWORD = config.get('SQL', 'DB_PASSWORD')

Connect to the database

In [3]:
DB_NAME = "movielens"
conn_string = f"postgresql://{DB_USER}:{DB_PASSWORD}@127.0.0.1/{DB_NAME}"
%sql $conn_string

# Writing SQL Queries

After all these steps, we can finaly begin writing SQL queries

In [4]:
%%sql

SELECT *
FROM movies
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/movielens
5 rows affected.

[(1, 'Toy Story', 'Toy Story', datetime.date(1995, 10, 30), 81, 'Animation, Comedy, Family', 'United States of America', 'Pixar Animation Studios', 'en', 30000000, 373554033, 21.946943, 7.7, 5415),
 (2, 'Jumanji', 'NULL', datetime.date(1995, 12, 15), 104, 'Adventure, Family, Fantasy', 'United States of America', 'TriStar Pictures, Teitler Film, Interscope Communications', 'en', 65000000, 262797249, 17.015539, 6.9, 2413),
 (3, 'Grumpier Old Men', 'Grumpy Old Men', datetime.date(1995, 12, 22), 101, 'Comedy, Romance', 'United States of America', 'Warner Bros., Lancaster Gate', 'en', 0, 0, 11.7129, 6.5, 92),
 (4, 'Waiting to Exhale', 'NULL', datetime.date(1995, 12, 22), 127, 'Comedy, Drama, Romance', 'United States of America', 'Twentieth Century Fox Film Corporation', 'en', 16000000, 81452156, 3.859495, 6.1, 34),
 (5, 'Father of the Bride Part II', 'Father of the Bride', datetime.date(1995, 2, 10), 106, 'Comedy', 'United States of America', 'Sandollar Productions, Touchstone Pictures', 'en', 0, 76578911, 8.387519, 5.7, 173)]

There are still some imperfections. For example, values in revenue are too big to adequately distinguish or column names are sometimes too long. Thus, here arises a wonderful opportunity to demostrate the use of VIEW and the knowledge of ROUND and AS commands

## Creating of VIEW


Hmm, the 'budget' and 'revenue' columns contain very large values, making it difficult to distinguish between them.. Thus, to improve readability, let's divide the values in the 'revenue' and 'budget' columns by one million, as movie budgets and revenues are typically counted in millions.

Also, let's round 'popularity' column to 2 decimal places for better readability

In [5]:
%%sql

SELECT
    title,
    release_date,
    budget,
    ROUND(budget / 1000000::NUMERIC, 2) AS budget_in_millions,
    revenue,
    ROUND(revenue / 1000000::NUMERIC, 2) AS revenue_in_millions,
    popularity,
    ROUND(popularity::NUMERIC, 2) AS popularity_rounded
FROM movies
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/movielens
5 rows affected.

[('Toy Story', datetime.date(1995, 10, 30), 30000000, Decimal('30.00'), 373554033, Decimal('373.55'), 21.946943, Decimal('21.95')),
 ('Jumanji', datetime.date(1995, 12, 15), 65000000, Decimal('65.00'), 262797249, Decimal('262.80'), 17.015539, Decimal('17.02')),
 ('Grumpier Old Men', datetime.date(1995, 12, 22), 0, Decimal('0.00'), 0, Decimal('0.00'), 11.7129, Decimal('11.71')),
 ('Waiting to Exhale', datetime.date(1995, 12, 22), 16000000, Decimal('16.00'), 81452156, Decimal('81.45'), 3.859495, Decimal('3.86')),
 ('Father of the Bride Part II', datetime.date(1995, 2, 10), 0, Decimal('0.00'), 76578911, Decimal('76.58'), 8.387519, Decimal('8.39'))]

Everything else appears to be fine except long column names and the column 'original_language', which we'll shorten to just 'language'. Time to create a VIEW called 'mv' (i.e., movies view) that will incorporate all the improvements we've made

In [6]:
%%sql

CREATE VIEW mv AS
SELECT
    id,
    title,
    franchise,
    release_date,
    runtime,
    genres,
    production_country AS prod_country,
    productioN_companies AS prod_companies,
    original_language AS lang,
    ROUND(budget / 1000000::NUMERIC, 2) AS budget_in_millions,
    ROUND(revenue / 1000000::NUMERIC, 2) AS revenue_in_millions,
    ROUND(popularity::NUMERIC, 2) AS popularity,
    vote_average AS vote_avg,
    vote_count
FROM movies;

 * postgresql://postgres:***@127.0.0.1/movielens
(psycopg2.errors.DuplicateTable) relation "mv" already exists

[SQL: CREATE VIEW mv AS
SELECT
    id,
    title,
    franchise,
    release_date,
    runtime,
    genres,
    production_country AS prod_country,
    productioN_companies AS prod_companies,
    original_language AS lang,
    ROUND(budget / 1000000::NUMERIC, 2) AS budget_in_millions,
    ROUND(revenue / 1000000::NUMERIC, 2) AS revenue_in_millions,
    ROUND(popularity::NUMERIC, 2) AS popularity,
    vote_average AS vote_avg,
    vote_count
FROM movies;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [7]:
%%sql

-- DROP VIEW mv;

 * postgresql://postgres:***@127.0.0.1/movielens
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: -- DROP VIEW mv;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [8]:
%%sql

SELECT *
FROM mv
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/movielens
5 rows affected.

[(1, 'Toy Story', 'Toy Story', datetime.date(1995, 10, 30), 81, 'Animation, Comedy, Family', 'United States of America', 'Pixar Animation Studios', 'en', Decimal('30.00'), Decimal('373.55'), Decimal('21.95'), 7.7, 5415),
 (2, 'Jumanji', 'NULL', datetime.date(1995, 12, 15), 104, 'Adventure, Family, Fantasy', 'United States of America', 'TriStar Pictures, Teitler Film, Interscope Communications', 'en', Decimal('65.00'), Decimal('262.80'), Decimal('17.02'), 6.9, 2413),
 (3, 'Grumpier Old Men', 'Grumpy Old Men', datetime.date(1995, 12, 22), 101, 'Comedy, Romance', 'United States of America', 'Warner Bros., Lancaster Gate', 'en', Decimal('0.00'), Decimal('0.00'), Decimal('11.71'), 6.5, 92),
 (4, 'Waiting to Exhale', 'NULL', datetime.date(1995, 12, 22), 127, 'Comedy, Drama, Romance', 'United States of America', 'Twentieth Century Fox Film Corporation', 'en', Decimal('16.00'), Decimal('81.45'), Decimal('3.86'), 6.1, 34),
 (5, 'Father of the Bride Part II', 'Father of the Bride', datetime.date(1995, 2, 10), 106, 'Comedy', 'United States of America', 'Sandollar Productions, Touchstone Pictures', 'en', Decimal('0.00'), Decimal('76.58'), Decimal('8.39'), 5.7, 173)]

As a reminder of what each column stands for, let's bring columns explanations with the incorporation of recent changes

Columns explanation:
- id - row id
- title - official title of the movie
- franchise - a particular franchise to which the movie belongs, if applicable
- release_date - theatrical release date of the movie
- runtime - movie duration/runtime in minutes
- genres - genres associated with the movie, separated by a comma
- prod_country - the country/countries where the movie was shot/produced. If several countries were involved, the cell contains the value 'Multiple'
- prod_companies - production companies involved in making of the movie
- lang - the language in which the movie was originally shot
- budget_in_millions - movie budget in millions of dollars
- revenue_in_millions - total movie revenue in millions of dollars
- popularity - popularity score assigned by TMDB
- vote_avg - average movie rating
- vote_count - number of votes by users, counted by TMDB

Now that the data is in satisfactory shape, we can finally start asking questions and trying to find answers to them.

## Question - Answer

### Q: Count how many movies were released in each month. Determine the month (or months) with the highest number of movie releases

In [9]:
%%sql

SELECT
    -- Represent month as a word instead of a number
    TO_CHAR(TO_DATE(EXTRACT(MONTH FROM release_date)::TEXT, 'MM'), 'Month') AS release_month,
    COUNT(id) AS movie_count,
    ROUND((COUNT(*)::NUMERIC / (SELECT COUNT(*) FROM mv) * 100), 2) AS movie_percentage
FROM mv
GROUP BY EXTRACT(MONTH FROM release_date)
ORDER BY EXTRACT(MONTH FROM release_date) ASC;

 * postgresql://postgres:***@127.0.0.1/movielens
12 rows affected.

[('January  ', 5912, Decimal('13.03')),
 ('February ', 3032, Decimal('6.68')),
 ('March    ', 3553, Decimal('7.83')),
 ('April    ', 3453, Decimal('7.61')),
 ('May      ', 3339, Decimal('7.36')),
 ('June     ', 3153, Decimal('6.95')),
 ('July     ', 2640, Decimal('5.82')),
 ('August   ', 3394, Decimal('7.48')),
 ('September', 4838, Decimal('10.66')),
 ('October  ', 4615, Decimal('10.17')),
 ('November ', 3661, Decimal('8.07')),
 ('December ', 3786, Decimal('8.34'))]

__A: January (13%), closely followed by September and October (11% and 10%), has the highest number of released movies.__

This finding coincides with the fact that in the film-making industry, these months are considered to be dump months:

"January, February, and the months following summer (especially September) have fewer high-profile movies because people are going to the movies less due to work and school, but the studios still need to release movies." (source: https://movieweb.com/january-movies-dump-month/)

Okay, now that we learned about dump months, let's try to find the answer to the following question

### Q: Find the months when high revenue movies (100+ million USD) are usualy released

In [10]:
%%sql

SELECT
    -- Represent month as a word instead of a number
    TO_CHAR(TO_DATE(EXTRACT(MONTH FROM release_date)::TEXT, 'MM'), 'Month') AS release_month,
    COUNT(id) AS movie_count,
    ROUND((COUNT(*)::NUMERIC / (SELECT COUNT(*) FROM mv WHERE revenue_in_millions > 100) * 100), 2) AS movie_percentage
FROM mv
WHERE revenue_in_millions > 100
GROUP BY EXTRACT(MONTH FROM release_date)
ORDER BY EXTRACT(MONTH FROM release_date) ASC;

 * postgresql://postgres:***@127.0.0.1/movielens
12 rows affected.

[('January  ', 44, Decimal('3.22')),
 ('February ', 79, Decimal('5.78')),
 ('March    ', 96, Decimal('7.02')),
 ('April    ', 70, Decimal('5.12')),
 ('May      ', 134, Decimal('9.80')),
 ('June     ', 185, Decimal('13.53')),
 ('July     ', 152, Decimal('11.12')),
 ('August   ', 88, Decimal('6.44')),
 ('September', 85, Decimal('6.22')),
 ('October  ', 96, Decimal('7.02')),
 ('November ', 137, Decimal('10.02')),
 ('December ', 201, Decimal('14.70'))]

__A: December (15%), June (14%), and July (11%) have the highest number of high revenue movies.__

This finding comes as no surprise because

"The most lucrative times of year for Hollywood are when schools are on break. As such, most major blockbusters and films expected to be box office hits are released during the Summer May-August window and the second half of December." (source: https://movieweb.com/january-movies-not-good/)

Since we're already on high revenue movies and dates, let's find out on what day of week they are usualy released

### Q: Find on what day of week high revenue movies get released

In [11]:
%%sql

SELECT
    TO_CHAR(release_date, 'Day') AS release_day_of_week,
    COUNT(id) AS movie_count,
    ROUND((COUNT(*)::NUMERIC / (SELECT COUNT(*) FROM mv WHERE revenue_in_millions > 100) * 100), 2) AS movie_percentage
FROM mv
WHERE revenue_in_millions > 100
GROUP BY EXTRACT(ISODOW FROM release_date), release_day_of_week
ORDER BY EXTRACT(ISODOW FROM release_date) ASC;

 * postgresql://postgres:***@127.0.0.1/movielens
7 rows affected.

[('Monday   ', 57, Decimal('4.17')),
 ('Tuesday  ', 122, Decimal('8.92')),
 ('Wednesday', 331, Decimal('24.21')),
 ('Thursday ', 348, Decimal('25.46')),
 ('Friday   ', 425, Decimal('31.09')),
 ('Saturday ', 48, Decimal('3.51')),
 ('Sunday   ', 36, Decimal('2.63'))]

__A: Friday (31%) with Thursday (25%) and Wednesday (24%) dominate here. In other words, staggering 80% of high revenue movies are released in the middle of the week (Wednesday - Friday).__

### Q: Per each decade, find top 3 most popular movies from the middle of the 20th century (1940-69)

In [12]:
%%sql

WITH step1 AS (
    SELECT
        title,
        CASE EXTRACT(DECADE FROM release_date)
            WHEN 194 THEN '40s'
            WHEN 195 THEN '50s'
            WHEN 196 THEN '60s'
        END AS decade,
        popularity,
        ROW_NUMBER() OVER (
            PARTITION BY EXTRACT(DECADE FROM release_date)
            ORDER BY popularity DESC
        ) AS rn
    FROM mv
    WHERE EXTRACT(YEAR FROM release_date) BETWEEN 1940 AND 1969
)
SELECT
    title,
    decade,
    popularity
FROM step1
WHERE rn <= 3
ORDER BY decade, rn;

 * postgresql://postgres:***@127.0.0.1/movielens
9 rows affected.

[('Citizen Kane', '40s', Decimal('15.81')),
 ("It's a Wonderful Life", '40s', Decimal('15.03')),
 ('Dumbo', '40s', Decimal('14.66')),
 ('On the Waterfront', '50s', Decimal('18.21')),
 ('Vertigo', '50s', Decimal('18.21')),
 ('Rear Window', '50s', Decimal('17.91')),
 ('Psycho', '60s', Decimal('36.83')),
 ('The Jungle Book', '60s', Decimal('22.85')),
 ('2001: A Space Odyssey', '60s', Decimal('22.49'))]

### Q: Find the number and percentage of movies with runtimes of up to an hour, two hours, three hours, and more

In [13]:
%%sql

WITH step1 AS (
    SELECT
        id,
        CASE
            WHEN runtime > 0 AND runtime < 61 THEN '1 hour'
            WHEN runtime > 60 AND runtime < 121 THEN '2 hours'
            WHEN runtime > 120 AND runtime < 181 THEN '3 hours'
            ELSE 'More'
        END AS runtime_group
    FROM mv
    WHERE runtime > 0
)
SELECT
    runtime_group,
    COUNT(id) AS count,
    ROUND((COUNT(id)::NUMERIC / (SELECT COUNT(*) FROM mv)) * 100, 2) AS percentage
FROM step1
GROUP BY runtime_group
ORDER BY runtime_group ASC;

 * postgresql://postgres:***@127.0.0.1/movielens
4 rows affected.

[('1 hour', 2615, Decimal('5.76')),
 ('2 hours', 35975, Decimal('79.28')),
 ('3 hours', 4489, Decimal('9.89')),
 ('More', 516, Decimal('1.14'))]

### Q: Find top 4 most spectacular movie successes and failures by profit

"The general rule of thumb is that movies need to make 2.5 times their budgets to turn a profit, as marketing costs are typically equal to production budgets, and then movie theaters get a cut of ticket sales."
(source: https://screenrant.com/fast-x-box-office-breakdown-success-flop/#:~:text=The%20general%20rule%20of%20thumb,a%20cut%20of%20ticket%20sales.)

However, because we're dealing mostly with blockbusters that cost 100+ millions of USD, we'll make it 1.5 instead of 2.5.

In [15]:
%%sql

WITH step1 AS (
    SELECT
        title,
        EXTRACT(YEAR FROM release_date) AS release_year,
        ROUND(1.5 * budget_in_millions, 2) AS appr_expenses_in_millions,
        revenue_in_millions,
        ROUND((revenue_in_millions - 1.5 * budget_in_millions), 2) AS profit_in_millions
    FROM mv
    -- remove empty or wrong values that can influece the result
    WHERE budget_in_millions >= 1 AND revenue_in_millions >= 1
), step2 AS (
    SELECT
        *,
        CASE
            WHEN profit_in_millions > 0 THEN 'Success'
            ELSE 'Failure'
        END AS profit_state,
        ROW_NUMBER() OVER (ORDER BY profit_in_millions DESC) AS rank_highest_profit,
        ROW_NUMBER() OVER (ORDER BY profit_in_millions ASC) AS rank_lowest_profit
    FROM step1
)
SELECT
    title,
    release_year,
    profit_state AS state,
    appr_expenses_in_millions,
    revenue_in_millions,
    profit_in_millions
FROM step2
WHERE rank_highest_profit <= 4 OR rank_lowest_profit <= 4
ORDER BY profit_in_millions ASC;

 * postgresql://postgres:***@127.0.0.1/movielens
8 rows affected.

[('The Lone Ranger', Decimal('2013'), 'Failure', Decimal('382.50'), Decimal('89.29'), Decimal('-293.21')),
 ('Valerian and the City of a Thousand Planets', Decimal('2017'), 'Failure', Decimal('296.21'), Decimal('90.02'), Decimal('-206.19')),
 ('The Alamo', Decimal('2004'), 'Failure', Decimal('217.50'), Decimal('25.82'), Decimal('-191.68')),
 ('Mars Needs Moms', Decimal('2011'), 'Failure', Decimal('225.00'), Decimal('38.99'), Decimal('-186.01')),
 ('Jurassic World', Decimal('2015'), 'Success', Decimal('225.00'), Decimal('1513.53'), Decimal('1288.53')),
 ('Titanic', Decimal('1997'), 'Success', Decimal('300.00'), Decimal('1845.03'), Decimal('1545.03')),
 ('Star Wars: The Force Awakens', Decimal('2015'), 'Success', Decimal('367.50'), Decimal('2068.22'), Decimal('1700.72')),
 ('Avatar', Decimal('2009'), 'Success', Decimal('355.50'), Decimal('2787.97'), Decimal('2432.47'))]

### Q: {HAVEN'T FIGURED OUT YET}

Well, I need to something with production companies, francises, and genras

In [19]:
%%sql

SELECT *
FROM mv
WHERE franchise = 'NULL'
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/movielens
5 rows affected.

[(2, 'Jumanji', 'NULL', datetime.date(1995, 12, 15), 104, 'Adventure, Family, Fantasy', 'United States of America', 'TriStar Pictures, Teitler Film, Interscope Communications', 'en', Decimal('65.00'), Decimal('262.80'), Decimal('17.02'), 6.9, 2413),
 (4, 'Waiting to Exhale', 'NULL', datetime.date(1995, 12, 22), 127, 'Comedy, Drama, Romance', 'United States of America', 'Twentieth Century Fox Film Corporation', 'en', Decimal('16.00'), Decimal('81.45'), Decimal('3.86'), 6.1, 34),
 (6, 'Heat', 'NULL', datetime.date(1995, 12, 15), 170, 'Action, Crime, Drama, Thriller', 'United States of America', 'Regency Enterprises, Forward Pass, Warner Bros.', 'en', Decimal('60.00'), Decimal('187.44'), Decimal('17.92'), 7.7, 1886),
 (7, 'Sabrina', 'NULL', datetime.date(1995, 12, 15), 127, 'Comedy, Romance', 'Multiple', 'Paramount Pictures, Scott Rudin Productions, Mirage Enterprises, Sandollar Productions, Constellation Entertainment, Worldwide, Mont Blanc Entertainment GmbH', 'en', Decimal('58.00'), Decimal('0.00'), Decimal('6.68'), 6.2, 141),
 (8, 'Tom and Huck', 'NULL', datetime.date(1995, 12, 22), 97, 'Action, Adventure, Drama, Family', 'United States of America', 'Walt Disney Pictures', 'en', Decimal('0.00'), Decimal('0.00'), Decimal('2.56'), 5.4, 45)]